[
  {
    "name": "Cameron Brew",
    "role": "Operational & Clinical Director",
    "image": "https://scrxcdn.fra1.cdn.digitaloceanspaces.com/cam.jpg",
    "qualifications": [
      "Sport and Exercise Science BSc",
      "Physiotherapy MSc",
      "FIFA Diploma in Football Medicine",
      "Member of the Chartered Society of Physiotherapy"
    ],
    "description": "Cameron graduated from Brunel University with a degree in Sports and Exercise Science (Human Performance BSc) and went on to train as a Physiotherapist at the University of Brighton (MSc). He began his professional career as a rotational Physiotherapist and later specialised in Musculoskeletal (MSK) Physiotherapy, where he advanced to become a Band 7 Team Leader of the shoulder pathway. Cameron has also gained extensive experience working in elite sports settings. He supports 26 national and international level athletes as part of the University of Portsmouth Elite Performance Scholarship pathway and is a registered physiotherapist for the National Talented Athlete Scholarship Scheme. Additionally, he is part of the performance team for several elite athletes, including professional boxer Michael McKinson and gold medal-winning Paralympic triathlete Lauren Steadman. Cameron is the Director of South Coast Rx Physiotherapy, where he continues to apply his expertise and passion for sports and rehabilitation. Beyond his clinical role, Cameron has always had a deep love for sports and exercise. He grew up as an avid rugby player, but after sustaining multiple ACL injuries, he was forced to hang up his boots. He remains passionate about sports and exercise, competing in triathlons, CrossFit, and golf, always seeking new challenges whenever possible."
  },
  {
    "name": "Daniel Rebolledo",
    "role": "Financial & Clinical Director",
    "image": "https://scrxcdn.fra1.cdn.digitaloceanspaces.com/dan.jpg",
    "qualifications": [
      "Sport and Exercise Science BSc",
      "Physiotherapy MSc",
      "Member of the Chartered Society of Physiotherapy"
    ],
    "description": "Dan graduated from the University of Southampton with two Distinction degrees in Sport and Exercise Science (BSc) and Physiotherapy (MSc). He then started his professional career within the NHS where he worked his way up to become a band 7 Team Leader and specialised in the rehabilitation of shoulder injuries. \n\nIn sport, Dan has worked with a range of Great Britain professional athletes  including, sailing, boxing, judo, American football and triathletes. \n\nDan has also worked privately as a physiotherapist overseas in New Zealand and Australia and is a guest lecturer on the MSc Physiotherapy degree at the University of Southampton & Portsmouth.\n\nDan loves working as a physiotherapist due to the life changing impact you can make on peoples lives.\n\nOutside of physiotherapy, sport and exercise has always been Dan’s passion. He has competed nationally at the British Athletics Championships and at the UK and New Zealand Cross-fit Nationals where he finished 3rd in the Team event."
  },
  {
    "name": "Helena Dickin",
    "role": "Pilates Team Leader, Senior Physiotherapist",
    "image": null,
    "qualifications": [
      "Exercise and Sports Science BSc",
      "Physiotherapy MSc",
      "Australian Physiotherapy Pilates Institute Mat Work Levels 1 and 2",
      "Ante and Post Natal Pilates"
    ],
    "description": "I have worked in the private sector for 6 years which has given me experience in treating a multitude of conditions. I use a combination of rehabilitation, hands on techniques amongst global health and wellbeing to optimise my clients recovery. \n\nIn addition to this, I am very passionate about clinical rehabilitation pilates and trained with the Australian Physiotherapy PIlates Institute Mat work levels 1 and 2 alongside ante and post natal pilates. I enjoy using principles of pilates within my Physiotherapy work and working with clients 1:1 as well as pilates classes. In my own time, I enjoy pilates self practice, recreational running, a triathlon or two and can also occasionally be found on the netball court!"
  },
  {
    "name": "Luke Smitherad",
    "role": "Sports Performance Physiotherapist",
    "image": null,
    "qualifications": [
      "Physiotherapy BSc Hons",
      "Band 7 Lower Limb Team Leader",
      "Sports Massage",
      "Sports and Kinesiology Taping"
    ],
    "description": "Hobbies/interests:  Running, gym and 20 years of playing hockey to premiership level.\n\nApproach to physio:  To get the patient back to their hobbies and interests as quick as possible whilst enjoying the journey and learning along the way."
  },
  {
    "name": "Christian Robinson",
    "role": "Sports Performance Physiotherapist",
    "image": null,
    "qualifications": [
      "Sport and Exercise Science BSc",
      "Physiotherapy MSc"
    ],
    "description": "Christian has honed his skills in treating a variety of musculoskeletal conditions. However, his true passion lies in working with runners. His personal experiences in completing marathons, ultra-marathons and ironman triathlons gives him a unique understanding of the demands of high-performance training and the frustrations of injury setbacks. \n\nBeyond his professional expertise, Christian is known for his passion and commitment to his patients. He fosters a positive, friendly, and approachable environment where individuals feel supported in their journey towards their goals.\n\nWhether you're a competitive athlete striving for peak performance or a recreational runner aiming to stay injury-free, Christian offers comprehensive care tailored to your needs. \n\nYou can find him on Instagram under @scrxrunningphysio"
  },
  {
    "name": "Sarah Bamford",
    "role": "Clinical Specialist Paediatric & Adolescent Physiotherapist",
    "image": null,
    "qualifications": [
      "Sports Rehabilitation BSc",
      "Physiotherapy BSc"
    ],
    "description": "Sarah is a Clinical Specialist Physiotherapist in Children and Adolescents working for the NHS and now South Coast Rx Physiotherapy. She has over 10 years’ experience in the NHS, and privately within high level sports such as rugby and hockey. She started her career with a degree in Sports Rehabilitation followed by a Physiotherapy degree from Southampton University, and further onto study the specialism of MSK Paediatrics and the Young Athlete. She has previously worked across both Childrens and Adults services as Clinical MSK Lead, with a specialist interest in shoulders and high level rehabilitation. She regularly lectures and educates others in this area and has passion to raise the awareness that Children are not little adults."
  },
  {
    "name": "Dan Young",
    "role": "Senior Physiotherapist",
    "image": null,
    "qualifications": [
      "Sport and Exercise Science BSc",
      "Physiotherapy MSc",
      "Member of the Chartered Society of Physiotherapy"
    ],
    "description": "Dan graduated from the University of Southampton with distinction degrees in Sport and Exercise Science (BSc) and Physiotherapy (MSc). He began his professional career within the NHS, progressing to become a Band 7 Team Leader specializing in shoulder injury rehabilitation. In the sports sector, Dan has worked with a range of Great Britain professional athletes, including those in sailing, boxing, judo, American football, and triathlons. He has also worked privately as a physiotherapist overseas in New Zealand and Australia and serves as a guest lecturer on the MSc Physiotherapy degree at the University of Southampton and Portsmouth. Dan is passionate about the life-changing impact physiotherapy can have on people's lives. Outside of his professional role, he has competed nationally at the British Athletics Championships and at the UK and New Zealand CrossFit Nationals, where he finished third in the team event."
  },
  {
    "name": "Samantha Groves",
    "role": "Pitchside Team, Leader Paediatric and Adolescent Physiotherapist",
    "image": null,
    "qualifications": [
      "Sport and Exercise Science BSc Hons",
      "Physiotherapy MSc",
      "Sports Massage Level 3 Diploma",
      "Acupuncture",
      "Sport and Kinesiology Taping"
    ],
    "description": "Hobbies/interests: Rugby, both pitchside and playing at county and championship level. I love all things sports!\n\nApproach to physio: \n\nI love helping people work towards their goals, however big or small! I utilise a very active treatment approach which is tailored to the individual. I also have a special interest in working with children and adolescents. is, the way you tell your story online can make all the difference."
  },
  {
    "name": "Rupak Pun",
    "role": "Sports Therapist",
    "image": null,
    "qualifications": [
      "MSci Sports Therapy",
      "Level 4 ITMMIF Qualified",
      "Level 1 OMT Spinal Manipulation"
    ],
    "description": "I graduated from the University of Chichester with a MSci Degree in Sports Therapy. Post graduation, I have been working in elite football as a  1st team Sports Therapist for Portsmouth FC. Outside of my day job I love sport and exercise and try to make time for as much golf as possible!"
  },
  {
    "name": "Adam Toy",
    "role": "Physiotherapist",
    "image": null,
    "qualifications": [
      "MSc Physiotherapy (Hons)",
      "BSc Sport and Exercise Science"
    ],
    "description": "I am a dedicated and experienced physiotherapist with a passion for helping individuals achieve their optimal physical health and performance. With a strong academic background and wealth of practical experience, I am committed to providing personalised and effective treatment plans tailored to each client's unique needs.\n\nBefore pursuing a career in physiotherapy, I had the privilege of coaching Olympic and world-class athletes in swimming, as well as a diverse range of recreational athletes at the Surrey Institute of Sport. This experience has given me a deep understanding of the demands placed on athletes and the importance of tailored rehabilitation and conditioning programs."
  },
  {
    "name": "Emily Goss",
    "role": "Senior Sports Therapist",
    "image": null,
    "qualifications": [
      "BSc Sports Therapy (Hons)",
      "REPs Level 3 Personal Trainer"
    ],
    "description": "I graduated from the university of Chichester in 2022. For the past 3 years I have been working within the NHS as an MSK Clinician in an outpatient physiotherapy department. \n\nMy sporting background is artistic gymnastics where I competed for Hampshire and the South Region at national competitions. This is where my passion for sports therapy/ physiotherapy began as I was exposed to injury and understood the importance of quick and efficient treatment and rehabilitation. \n\nI love helping people work towards their goals, whether they are part of the athletic population or are wanting to get to their activities of daily living. I aim to promote a positive and friendly environment where individuals feel supported to achieve their goals."
  },
  {
    "name": "Eleanor Todd",
    "role": "Sports Therapist",
    "image": null,
    "qualifications": [
      "BSc Sports Therapy (Hons)",
      "Level 4 Sports Massage",
      "ITC Pitch-Side Sports First Aid with AED Training"
    ],
    "description": "Hobbies/Interest: I have been playing competitive netball for 13 years; I currently play in Div 1 of the Hampshire Senior League. I also have an interest in football, having played when I was younger, and frequently enjoy going to watch Portsmouth play, as well as the WSL fixtures.\n\nApproach to physio: I am really passionate about fulfilling every individual’s goals no matter how big or small. From previous injuries myself I know how challenging the return to activities/sport can be, which is why I create a positive atmosphere during every session so that injury rehabilitation can be an enjoyable process to get you back to doing the activities you love."
  },
  {
    "name": "Miles Haslam",
    "role": "Physiotherapist",
    "image": null,
    "qualifications": [
      "MSc Physiotherapy"
    ],
    "description": "With over 4 years of hands-on experience in the field, Miles has dedicated his career to helping individuals achieve optimal health and performance. His journey into physiotherapy started following three knee surgeries due to a knee injury. This experience fuelled his passion for rehabilitation and sparked a commitment to assisting others in returning to the activities they love.\n\nMiles possesses a keen interest in sports-related rehabilitation, with a particular interest in running, golf, basketball, tennis and cricket. His personal experience with sports injuries gives him unique insights into the physical and emotional challenges his clients face, enabling him to support clients through their recovery journey, helping them regain strength, mobility, and confidence."
  },
  {
    "name": "Noah Clements",
    "role": "Senior Physiotherapist",
    "image": null,
    "qualifications": [
      "BSc Sports Rehabilitation",
      "MSc Physiotherapy"
    ],
    "description": "My personal experience as a footballer and previous high level tennis player gives me unique insights into the physical demands and challenges athletes face. This background fuels my enthusiasm for helping others achieve their optimal performance and recover from injuries effectively.\n\nThroughout my career, I've had the privilege of providing soft tissue work for esteemed teams such as the New Zealand Women's Rugby, Esher Rugby Club, and Richmond Rugby Club. These experiences have not only enriched my professional skills but also deepened my appreciation for the resilience and dedication of athletes.\n\nAs an avid sports watcher, I stay up-to-date with the latest developments and trends in various sports, ensuring that my approach to physiotherapy is both informed and contemporary. Whether you're a professional athlete, a weekend warrior, or someone looking to improve their physical well-being, I'm here to support you on your journey to peak health and performance."
  }
]

